In [4]:
#판다스 : 시리즈(시계열) 클래스, 데이터프레임 클래스
#시리즈 = 인덱스(데이터 의미 표시) + 값(데이터)
#20210804 35
#20210805 36
#20210806 34
#....

import pandas as pd

#리스트 1차원 배열 -> 시리즈 생성

In [13]:
pd.Series([1000,300,200]) #데이터만 기술, 인덱스는 자동 부여됨
print(pd.Series([1000,300,200], index=['서울인구','부산인구','대구인구']))
print(pd.Series([1000,300,200], index=['10','20','30']))
print(pd.Series([1000,300,200], index=[10,20,30]))
print(pd.Series([1000,300,200], index=[804,805,806]))
print(pd.Series([1000,300,200], index=['20210804','20210805','20210806']))
x=pd.Series([1000, 300, 200],index=['20210804', '20210805', '20210806'])

서울인구    1000
부산인구     300
대구인구     200
dtype: int64
10    1000
20     300
30     200
dtype: int64
10    1000
20     300
30     200
dtype: int64
804    1000
805     300
806     200
dtype: int64
20210804    1000
20210805     300
20210806     200
dtype: int64

In [17]:
# Label(라벨,레이블)
# loc 속성 : Label을 지정하여 데이터를 검색
# iloc 속성
x.loc['20210804']
x.iloc[-2]

300

In [27]:
y=pd.Series(range(10,15))
y

0    10
1    11
2    12
3    13
4    14
dtype: int64

In [28]:
y.index
y.values
y.name="데이터이름"
y

0    10
1    11
2    12
3    13
4    14
Name: 데이터이름, dtype: int64

In [ ]:
#넘파이 배열처럼 시리즈도 벡터화 연산 수행

In [29]:
x=pd.Series([1000,300,200], index=['10','11','12'])
x/100

10    10.0
11     3.0
12     2.0
dtype: float64

In [33]:
print(x)
x[10]
x[[10,11]]

10    1000
11     300
12     200
dtype: int64

IndexError: positional indexers are out-of-bounds

In [34]:
x=pd.Series([1000,300,200], index=['서울','부산','인천'])
x

서울    1000
부산     300
인천     200
dtype: int64

In [40]:
x['인천']
x.loc['인천']
x.iloc[2]
x[['인천']]
x[['인천','서울']]
x.iloc[-2]

300

In [42]:
print(x>250)
print((x>250) & (x<250))
x

서울     True
부산     True
인천    False
dtype: bool
서울    False
부산    False
인천    False
dtype: bool

In [44]:
x[0:2]

서울    1000
부산     300
dtype: int64

In [45]:
x.서울

1000

In [47]:
'부산' in x

True

In [49]:
for k,v in x.itemse():
    print(k,v)

AttributeError: 'Series' object has no attribute 'itemse'

In [48]:
x.values

array([1000,  300,  200], dtype=int64)

In [50]:
200 in x.values #연습

True

In [51]:
x= pd.Series([1000,400,300,200],
            index=['서울','부산','인천','광주'])
x

서울    1000
부산     400
인천     300
광주     200
dtype: int64

In [52]:
x2= pd.Series({'서울':1000,'부산':400,'인천':300,'광주':200})
x2

서울    1000
부산     400
인천     300
광주     200
dtype: int64

In [53]:
x+x2 # 인덱스가 동일한것 끼리 계산

서울    2000
부산     800
인천     600
광주     400
dtype: int64

In [58]:
x3= pd.Series({'서울':1000,'부산':400,'인천':300,'대전':200})
print(x+x3)
print(x-x3)
print(x*x3)

print(x.values - x3.values)# 인덱스가 아닌 데이터끼리 연산수행

광주       NaN
대전       NaN
부산     800.0
서울    2000.0
인천     600.0
dtype: float64
광주    NaN
대전    NaN
부산    0.0
서울    0.0
인천    0.0
dtype: float64
광주          NaN
대전          NaN
부산     160000.0
서울    1000000.0
인천      90000.0
dtype: float64
[0 0 0 0]

In [59]:
xx=x-x3
xx

광주    NaN
대전    NaN
부산    0.0
서울    0.0
인천    0.0
dtype: float64

In [64]:
print(xx.notnull(),"\n")

print(xx[xx.notnull()])

광주    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

부산    0.0
서울    0.0
인천    0.0
dtype: float64

In [66]:
p2020=pd.Series([1000,400,300,200],
            index=['서울','부산','인천','광주'])
p2030=pd.Series([900,300,200,300],
            index=['서울','부산','인천','광주'])
#인구 변화율을 출력

In [68]:
p20=p2030/p2020

In [70]:
p20['서울']=0.95
p20

서울    0.950000
부산    0.750000
인천    0.666667
광주    1.500000
dtype: float64

In [71]:
del p20['인천']
p20

서울    0.95
부산    0.75
광주    1.50
dtype: float64

# 시리즈 = 1차원 배열(벡터)+인덱스
# 데이터프레임 = 2차원 배열(행렬) + 인덱스

In [75]:
import numpy as np

In [72]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}

In [74]:
pd.DataFrame(data)
# 키가 데이터프레임의 열 인덱스가 됨
# 값은 데이터프레임의 데이터가 됨
# 0번~ 행 인덱스가 자동 부여됨

      2015     2010     2005     2000   지역  2010-2015 증가율
0  9904312  9631482  9762546  9853972  수도권         0.0283
1  3448737  3393191  3512547  3655437  경상권         0.0163
2  2890451  2632035  2517680  2466338  수도권         0.0982
3  2466052  2431774  2456016  2473990  경상권         0.0141

In [77]:
df=pd.DataFrame(data, index=['서울','부산','인천','대구'])
df

       2015     2010     2005     2000   지역  2010-2015 증가율
서울  9904312  9631482  9762546  9853972  수도권         0.0283
부산  3448737  3393191  3512547  3655437  경상권         0.0163
인천  2890451  2632035  2517680  2466338  수도권         0.0982
대구  2466052  2431774  2456016  2473990  경상권         0.0141

In [80]:
df=pd.DataFrame(data, index=['서울','부산','인천','대구'],
               columns=['지역','2000','2005','2010','2015','2020','2010-2015 증가율'])
df
# 2020은 NaN

     지역     2000     2005     2010     2015 2020  2010-2015 증가율
서울  수도권  9853972  9762546  9631482  9904312  NaN         0.0283
부산  경상권  3655437  3512547  3393191  3448737  NaN         0.0163
인천  수도권  2466338  2517680  2632035  2890451  NaN         0.0982
대구  경상권  2473990  2456016  2431774  2466052  NaN         0.0141

In [81]:
df=pd.DataFrame(data, index=['서울','부산','인천','대구'])
df

       2015     2010     2005     2000   지역  2010-2015 증가율
서울  9904312  9631482  9762546  9853972  수도권         0.0283
부산  3448737  3393191  3512547  3655437  경상권         0.0163
인천  2890451  2632035  2517680  2466338  수도권         0.0982
대구  2466052  2431774  2456016  2473990  경상권         0.0141

In [83]:
df.index #행 인덱스
df.columns #열 인덱스

Index(['2015', '2010', '2005', '2000', '지역', '2010-2015 증가율'], dtype='object')

In [87]:
# df.columns=['a','b','c','d','e','f']
# df

df.rename(columns={'지역':'a', '2000':'b',
                   '2005':'c', '2010':'d', 
                   '2020':'e', '2010-2015 증가율':'f'
})

df.rename(index={'서울':'s','부산':'b'})

          a        b        c        d    e       f
s   9904312  9631482  9762546  9853972  수도권  0.0283
b   3448737  3393191  3512547  3655437  경상권  0.0163
인천  2890451  2632035  2517680  2466338  수도권  0.0982
대구  2466052  2431774  2456016  2473990  경상권  0.0141

In [88]:
df=pd.DataFrame(data, index=['서울','부산','인천','대구'])
df

       2015     2010     2005     2000   지역  2010-2015 증가율
서울  9904312  9631482  9762546  9853972  수도권         0.0283
부산  3448737  3393191  3512547  3655437  경상권         0.0163
인천  2890451  2632035  2517680  2466338  수도권         0.0982
대구  2466052  2431774  2456016  2473990  경상권         0.0141

In [89]:
df.T

                    서울       부산       인천       대구
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
지역                 수도권      경상권      수도권      경상권
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [93]:
df['증가율']=df['2010-2015 증가율']*100
df

       2015     2010     2005     2000   지역  2010-2015 증가율   증가율
서울  9904312  9631482  9762546  9853972  수도권         0.0283  2.83
부산  3448737  3393191  3512547  3655437  경상권         0.0163  1.63
인천  2890451  2632035  2517680  2466338  수도권         0.0982  9.82
대구  2466052  2431774  2456016  2473990  경상권         0.0141  1.41

In [194]:
#pd.read_csv('data/data/gapminder.tsv')  컴마가 아닌 탭으로 구분되어 있어 sep해줘야함
df=pd.read_csv('data/data/gapminder.tsv', sep="\t")
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [102]:
df.shape[0]
df.columns
df.dtypes
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [106]:
print(df.head(3))
print(df.tail(3))

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
       country continent  year  lifeExp       pop   gdpPercap
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

142.0

In [109]:
print(df['country'])
print(df.country)

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object
0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [110]:
type(df.country)

pandas.core.series.Series

In [111]:
df.country.head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [112]:
df.country.tail()

1699    Zimbabwe
1700    Zimbabwe
1701    Zimbabwe
1702    Zimbabwe
1703    Zimbabwe
Name: country, dtype: object

In [113]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [117]:
subset=df[['country','continent','year']]
subset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
dtypes: int64(1), object(2)
memory usage: 40.1+ KB

In [125]:

# df의 첫번째 줄 출력하는 방법들

df.head(1)
df.iloc[0]
df.loc[0]
#loc, iloc는 시리즈 타입, 헤드는 데이터프레임 타입

df.values[0]

df.T[0] #0번 열 인덱스

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap     779.445314
Name: 0, dtype: object

In [127]:
df.iloc[-1] #loc는 -1 이런 참조가 안됌

country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

In [128]:
df.shape[0]

1704

In [129]:
df.loc[[0,100,200]]

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
100    Bangladesh      Asia  1972   45.252  70759295  630.233627
200  Burkina Faso    Africa  1992   50.260   8878303  931.752773

In [134]:
df['year']
df[['year','pop']]
#df[[ : ,'year','pop']] #df[행(범위), 열(범위)]
df.loc[3]
df.iloc[: , [2,4]]

      year       pop
0     1952   8425333
1     1957   9240934
2     1962  10267083
3     1967  11537966
4     1972  13079460
...    ...       ...
1699  1987   9216418
1700  1992  10704340
1701  1997  11404948
1702  2002  11926563
1703  2007  12311143

[1704 rows x 2 columns]

In [138]:
df.shape[1]
df.iloc[:, df.shape[1]-1]

0       779.445314
1       820.853030
2       853.100710
3       836.197138
4       739.981106
           ...
1699    706.157306
1700    693.420786
1701    792.449960
1702    672.038623
1703    469.709298
Name: gdpPercap, Length: 1704, dtype: float64

In [145]:
df.iloc[: , 2:6]
df.iloc[: , 2:6:2]

      year       pop
0     1952   8425333
1     1957   9240934
2     1962  10267083
3     1967  11537966
4     1972  13079460
...    ...       ...
1699  1987   9216418
1700  1992  10704340
1701  1997  11404948
1702  2002  11926563
1703  2007  12311143

[1704 rows x 2 columns]

In [151]:
df.iloc[[0,99,999] , [0,3,5]]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

In [152]:
df.drop_duplicates(['year'])

        country continent  year  lifeExp       pop   gdpPercap
0   Afghanistan      Asia  1952   28.801   8425333  779.445314
1   Afghanistan      Asia  1957   30.332   9240934  820.853030
2   Afghanistan      Asia  1962   31.997  10267083  853.100710
3   Afghanistan      Asia  1967   34.020  11537966  836.197138
4   Afghanistan      Asia  1972   36.088  13079460  739.981106
5   Afghanistan      Asia  1977   38.438  14880372  786.113360
6   Afghanistan      Asia  1982   39.854  12881816  978.011439
7   Afghanistan      Asia  1987   40.822  13867957  852.395945
8   Afghanistan      Asia  1992   41.674  16317921  649.341395
9   Afghanistan      Asia  1997   41.763  22227415  635.341351
10  Afghanistan      Asia  2002   42.129  25268405  726.734055
11  Afghanistan      Asia  2007   43.828  31889923  974.580338

In [176]:
df['country'].unique()
df['continent'].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania'], dtype=object)

In [184]:
df[df['pop']>50000000]

df[df['year']>1970]
df[df.year>1970]

df[df.pop>50000000] # pop이라는 메소드가 이미 있어서 안됨

TypeError: '>' not supported between instances of 'method' and 'int'

In [188]:
df=pd.DataFrame([[0,1,2],[3,4,5]], index=['r1','r2'], columns=['c1','c2','c3'])
df

    c1  c2  c3
r1   0   1   2
r2   3   4   5

In [189]:
df.pop('c2')

r1    1
r2    4
Name: c2, dtype: int64

In [190]:
df

    c1  c3
r1   0   2
r2   3   5

In [192]:
df.pop('c1')

r1    0
r2    3
Name: c1, dtype: int64

In [193]:
df

    c3
r1   2
r2   5

In [195]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]